reddit_clone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "asd"], ["url", "asdads"], ["content", "asdasd"], ["author_id", 2], ["created_at", "2021-04-12 21:29:21.798208"], ["updated_at", "2021-04-12 21:29:21.798208"]]
---
    def create
        @post = current_user.posts.new(post_params)

        if @post.save