reddit_clone/app/controllers/subs_controller.rb

    def create
        @sub = current_user.subs.new(sub_params)

        if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asdasda"], ["description", "asdasdad"], ["moderator_id", 2], ["created_at", "2021-04-12 18:29:14.655457"], ["updated_at", "2021-04-12 18:29:14.655457"]]

    def update
        @sub = Sub.find(params[:id])

        if @sub.update_attributes(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "SLEEP"], ["description", "Need it"], ["updated_at", "2021-04-12 18:39:17.088459"], ["id", 2]]